app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."user_id" = $1  [["user_id", 13]]
---
    def index
        @activity = Activity.where(user_id: @user.id)