app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"
---
    def index
        activity = Activity.all

INSERT INTO "activities" ("date", "name", "minutes", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date", "08/03/1989"], ["name", "meditation"], ["minutes", 2], ["notes", "good session"], ["created_at", "2022-03-18 19:28:07.876671"], ["updated_at", "2022-03-18 19:28:07.876671"]]
---
    def create
        activity = Activity.create!(activity_params)

DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 3]]
---
    def destroy
        activity = find_activity
        activity.destroy

SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def find_activity
        Activity.find(params[:id])