app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "qqq"], ["password_digest", "$2a$12$zyp5NOtpsE8gzi0wMUQLTuhf2cHA278x7YuzrGXIkAnq5O9z2j4ZO"], ["created_at", "2022-03-18 19:10:46.123379"], ["updated_at", "2022-03-18 19:10:46.123379"]]
---
     def create
      puts "=== in Users create"
        user = User.create!(user_params)